In [225]:
from pandas import pandas
from pydbgen import pydbgen
import numpy as np
from faker import Faker
from faker.providers import internet
from faker.providers import profile
fake.add_provider(internet)
fake.add_provider(profile)

In [226]:
myDB=pydbgen.pydb()

In [227]:
testdf=myDB.gen_dataframe(5,['name','city','state','zipcode','ssn','code1','code2'])
testdf

,name,city,state,zipcode,ssn,code1,code2
0,Shelby Lee,McLoud,West Virginia,55188,708-63-0150,None,None
1,Angela Fisher,Allenville,Pennsylvania,25860,836-58-2444,None,None
2,Stephanie Phelps,Shreve,Mississippi,22691,190-40-7139,None,None
3,Colleen Pena,Powder River,Rhode Island,45649,520-45-6531,None,None
4,Austin Miller,Etta,South Dakota,67162,543-03-3079,None,None

In [228]:
t1 = testdf.to_records(index=False)

In [229]:
type(t1)

numpy.recarray

In [230]:
import random
fake = Faker()
testdf["code1"] = random.randint(1, 100)
testdf["code2"] = fake.name()
testdf

,name,city,state,zipcode,ssn,code1,code2
0,Shelby Lee,McLoud,West Virginia,55188,708-63-0150,83,Christopher Coleman
1,Angela Fisher,Allenville,Pennsylvania,25860,836-58-2444,83,Christopher Coleman
2,Stephanie Phelps,Shreve,Mississippi,22691,190-40-7139,83,Christopher Coleman
3,Colleen Pena,Powder River,Rhode Island,45649,520-45-6531,83,Christopher Coleman
4,Austin Miller,Etta,South Dakota,67162,543-03-3079,83,Christopher Coleman

In [231]:
#testdf[0,6] = 'tt'

In [232]:
testdf

testdf.at[0,'code2'] = 'bb'
testdf

,name,city,state,zipcode,ssn,code1,code2
0,Shelby Lee,McLoud,West Virginia,55188,708-63-0150,83,bb
1,Angela Fisher,Allenville,Pennsylvania,25860,836-58-2444,83,Christopher Coleman
2,Stephanie Phelps,Shreve,Mississippi,22691,190-40-7139,83,Christopher Coleman
3,Colleen Pena,Powder River,Rhode Island,45649,520-45-6531,83,Christopher Coleman
4,Austin Miller,Etta,South Dakota,67162,543-03-3079,83,Christopher Coleman

In [233]:
df = pandas.DataFrame(np.random.randn(5,3),columns=list('ABC'))

In [234]:
df.at[0,'A']

-2.3675792004654235

In [235]:
print(len(df.index))

5

In [236]:
for x in df.index:
    print(0)
    x = x+1

0
0
0
0
0

In [237]:
for y in range(len(testdf.index)):
    testdf.at[y,'code2'] =  fake.ipv4_private() #np.random.randn(5,3)
    testdf.at[y,'sex'] =  fake.ein() #np.random.randn(5,3)

In [238]:
testdf

,name,city,state,zipcode,ssn,code1,code2,sex
0,Shelby Lee,McLoud,West Virginia,55188,708-63-0150,83,10.61.44.39,13-6854043
1,Angela Fisher,Allenville,Pennsylvania,25860,836-58-2444,83,172.23.57.239,40-0136397
2,Stephanie Phelps,Shreve,Mississippi,22691,190-40-7139,83,172.19.145.64,38-2842233
3,Colleen Pena,Powder River,Rhode Island,45649,520-45-6531,83,172.21.129.201,80-4400707
4,Austin Miller,Etta,South Dakota,67162,543-03-3079,83,172.26.201.9,20-1149798